sterentev/atdf-device-asm-include/inc/ATmega16HVB.inc
; ====	LOCKBIT MODULE REGISTERS BITS DEFINITION	========
;
; ----------	Register LOCKBIT bits		------------------------
.equ	LB_MASK		= 0x03		;      - Memory Lock (2 bits)
.equ	LB0		= 0		;          LB BIT0 position
.equ	BLB0_MASK	= 0x0C		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB00		= 2		;          BLB0 BIT0 position
.equ	BLB1_MASK	= 0x30		;      - Boot Loader Protection Mode (2 bits)
.equ	BLB10		= 4		;          BLB1 BIT0 position
; ::::  LB	:::: bitfield values
;			0x00		; Further programming and verification disabled
;			0x02		; Further programming disabled
;			0x03		; No memory lock features enabled
; ::::  BLB0	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Application Section
;			0x04		; LPM prohibited in Application Section
;			0x08		; SPM prohibited in Application Section
;			0x0C		; No lock on SPM and LPM in Application Section
; ::::  BLB1	:::: bitfield values
;			0x00		; LPM and SPM prohibited in Boot Section
;			0x10		; LPM prohibited in Boot Section
;			0x20		; SPM prohibited in Boot Section
;			0x30		; No lock on SPM and LPM in Boot Section




; **********************************************************************
; ***************	DATA REGISTERS		************************
; **********************************************************************
;
.equ	BPPLR		= 0xFE		; [MEMORY MAPPED] Battery Protection Parameter Lock Register
.equ	BPCR		= 0xFD		; [MEMORY MAPPED] Battery Protection Control Register
.equ	BPHCTR		= 0xFC		; [MEMORY MAPPED] Battery Protection Short-current Timing Register
.equ	BPOCTR		= 0xFB		; [MEMORY MAPPED] Battery Protection Over-current Timing Register
.equ	BPSCTR		= 0xFA		; [MEMORY MAPPED] Battery Protection Short-current Timing Register
.equ	BPCHCD		= 0xF9		; [MEMORY MAPPED] Battery Protection Charge-High-current Detection Level Register
.equ	BPDHCD		= 0xF8		; [MEMORY MAPPED] Battery Protection Discharge-High-current Detection Level Register
.equ	BPCOCD		= 0xF7		; [MEMORY MAPPED] Battery Protection Charge-Over-current Detection Level Register
.equ	BPDOCD		= 0xF6		; [MEMORY MAPPED] Battery Protection Discharge-Over-current Detection Level Register
.equ	BPSCD		= 0xF5		; [MEMORY MAPPED] Battery Protection Short-Circuit Detection Level Register
.equ	BPIFR		= 0xF3		; [MEMORY MAPPED] Battery Protection Interrupt Flag Register
.equ	BPIMSK		= 0xF2		; [MEMORY MAPPED] Battery Protection Interrupt Mask Register
.equ	CBCR		= 0xF1		; [MEMORY MAPPED] Cell Balancing Control Register
.equ	FCSR		= 0xF0		; [MEMORY MAPPED] FET Control and Status Register
.equ	CADRDC		= 0xEA		; [MEMORY MAPPED] CC-ADC Regular Discharge Current
.equ	CADRCC		= 0xE9		; [MEMORY MAPPED] CC-ADC Regular Charge Current
.equ	CADCSRC		= 0xE8		; [MEMORY MAPPED] CC-ADC Control and Status Register C
.equ	CADCSRB		= 0xE7		; [MEMORY MAPPED] CC-ADC Control and Status Register B
.equ	CADCSRA		= 0xE6		; [MEMORY MAPPED] CC-ADC Control and Status Register A
.equ	CADIC		= 0xE4		; [MEMORY MAPPED] CC-ADC Instantaneous Current
.equ	CADAC3		= 0xE3		; [MEMORY MAPPED] ADC Accumulate Current
.equ	CADAC2		= 0xE2		; [MEMORY MAPPED] ADC Accumulate Current
.equ	CADAC1		= 0xE1		; [MEMORY MAPPED] ADC Accumulate Current
.equ	CADAC0		= 0xE0		; [MEMORY MAPPED] ADC Accumulate Current
.equ	CHGDCSR		= 0xD4		; [MEMORY MAPPED] Charger Detect Control and Status Register
.equ	BGCSR		= 0xD2		; [MEMORY MAPPED] Bandgap Control and Status Register
.equ	BGCRR		= 0xD1		; [MEMORY MAPPED] Bandgap Calibration of Resistor Ladder
.equ	BGCCR		= 0xD0		; [MEMORY MAPPED] Bandgap Calibration Register
.equ	ROCR		= 0xC8		; [MEMORY MAPPED] Regulator Operating Condition Register
.equ	TWBCSR		= 0xBE		; [MEMORY MAPPED] TWI Bus Control and Status Register
.equ	TWAMR		= 0xBD		; [MEMORY MAPPED] TWI (Slave) Address Mask Register
.equ	TWCR		= 0xBC		; [MEMORY MAPPED] TWI Control Register
.equ	TWDR		= 0xBB		; [MEMORY MAPPED] TWI Data register
.equ	TWAR		= 0xBA		; [MEMORY MAPPED] TWI (Slave) Address register
.equ	TWSR		= 0xB9		; [MEMORY MAPPED] TWI Status Register
.equ	TWBR		= 0xB8		; [MEMORY MAPPED] TWI Bit Rate register
.equ	OCR1B		= 0x89		; [MEMORY MAPPED] Output Compare Register B
.equ	OCR1A		= 0x88		; [MEMORY MAPPED] Output Compare Register 1A
.equ	TCNT1		= 0x84		; [MEMORY MAPPED] Timer Counter 1 Bytes
.equ	TCCR1B		= 0x81		; [MEMORY MAPPED] Timer/Counter1 Control Register B
.equ	TCCR1A		= 0x80		; [MEMORY MAPPED] Timer/Counter 1 Control Register A
.equ	DIDR0		= 0x7E		; [MEMORY MAPPED] Digital Input Disable Register
.equ	VADMUX		= 0x7C		; [MEMORY MAPPED] The VADC multiplexer Selection Register
.equ	VADCSR		= 0x7A		; [MEMORY MAPPED] The VADC Control and Status register
.equ	VADC		= 0x78		; [MEMORY MAPPED] VADC Data Register Bytes
.equ	TIMSK1		= 0x6F		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	TIMSK0		= 0x6E		; [MEMORY MAPPED] Timer/Counter Interrupt Mask Register
.equ	PCMSK1		= 0x6C		; [MEMORY MAPPED] Pin Change Enable Mask Register 1
.equ	PCMSK0		= 0x6B		; [MEMORY MAPPED] Pin Change Enable Mask Register 0
.equ	EICRA		= 0x69		; [MEMORY MAPPED] External Interrupt Control Register
.equ	PCICR		= 0x68		; [MEMORY MAPPED] Pin Change Interrupt Control Register
.equ	FOSCCAL		= 0x66		; [MEMORY MAPPED] Fast Oscillator Calibration Value
.equ	PRR0		= 0x64		; [MEMORY MAPPED] Power Reduction Register 0
.equ	CLKPR		= 0x61		; [MEMORY MAPPED] Clock Prescale Register
.equ	WDTCSR		= 0x60		; [MEMORY MAPPED] Watchdog Timer Control Register
.equ	SREG		= 0x3F		; Status Register
.equ	SP		= 0x3D		; Stack Pointer 
.equ	SPMCSR		= 0x37		; Store Program Memory Control and Status Register
.equ	MCUCR		= 0x35		; MCU Control Register
.equ	MCUSR		= 0x34		; MCU Status Register
.equ	SMCR		= 0x33		; Sleep Mode Control Register
.equ	SPDR		= 0x2E		; SPI Data Register
.equ	SPSR		= 0x2D		; SPI Status Register
.equ	SPCR		= 0x2C		; SPI Control Register
.equ	GPIOR2		= 0x2B		; General Purpose IO Register 2
.equ	GPIOR1		= 0x2A		; General Purpose IO Register 1
.equ	OCR0B		= 0x29		; Output Compare Register B
.equ	OCR0A		= 0x28		; Output Compare Register A
.equ	TCNT0		= 0x26		; Timer Counter 0 Bytes
.equ	TCCR0B		= 0x25		; Timer/Counter0 Control Register B
.equ	TCCR0A		= 0x24		; Timer/Counter 0 Control Register A
.equ	GTCCR		= 0x23		; General Timer/Counter Control Register
.equ	EEAR		= 0x21		; EEPROM Read/Write Access
.equ	EEDR		= 0x20		; EEPROM Data Register
.equ	EECR		= 0x1F		; EEPROM Control Register
.equ	GPIOR0		= 0x1E		; General Purpose IO Register 0
.equ	EIMSK		= 0x1D		; External Interrupt Mask Register
.equ	EIFR		= 0x1C		; External Interrupt Flag Register
.equ	PCIFR		= 0x1B		; Pin Change Interrupt Flag Register
.equ	OSICSR		= 0x17		; Oscillator Sampling Interface Control and Status Register
.equ	TIFR1		= 0x16		; Timer/Counter Interrupt Flag register
.equ	TIFR0		= 0x15		; Timer/Counter Interrupt Flag register
.equ	PORTC		= 0x08		; Port C Data Register
.equ	PINC		= 0x06		; Port C Input Pins
.equ	PORTB		= 0x05		; Port B Data Register
.equ	DDRB		= 0x04		; Port B Data Direction Register
.equ	PINB		= 0x03		; Port B Input Pins
.equ	PORTA		= 0x02		; Port A Data Register
.equ	DDRA		= 0x01		; Port A Data Direction Register
.equ	PINA		= 0x00		; Port A Input Pins


; ====	ADC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register VADMUX bits		------------------------
.equ	VADMUX_MASK	= 0x0F		;      - Analog Channel and Gain Selection Bits (4 bits)
.equ	VADMUX0		= 0		;          VADMUX BIT0 position

; ----------	Register VADC bits		------------------------
.equ	VADC_MASK	= 0x0FFF	;      - VADC Data bits (12 bits)
.equ	VADC0		= 0		;          VADC BIT0 position

